Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/court_offices/circuit_court_office.html.txt.tmx
Source language: en
Languages: ga

source: There are Circuit Court offices throughout Ireland
ga: Tá Cúirte Chuardaí ar fáil ar fud na tíre

source: A County Registrar heads each office
ga: Tá Cláraitheoir Condae i gceannas ar gach oifig acu

source: The Circuit Court office
ga: Oifig na Cúirte Chuardaí

source: • issues and processes proceedings in civil cases
ga: • Eisíonn sé agus déanann próiséal ar chásanna sibhialta

source: • prepares and issues the orders of the Circuit Court
ga: • Ullmhaíonn agus eisíonn sé ordaithe na Cúirte Chuardaí

source: • provides District Probate Registries based in 14 Circuit Court offices around the country
ga: • Cuireann sé clarú próbháid ceantair ar fáil atá bunaithe in oifigí na Cúirte Chuardaí i 14 áit ar fud na tíre

source: • The County Registrar of each county manages jury selection for Circuit Criminal Courts in that county
ga: • Tógann an Cláraitheoir Condae, ina c/(h)ondae féin, cúram roghnú giúire don Chúirt Choiriúil Chuarda air/uirthi féin

source: • The Dublin Circuit Court office manages jury selection for the Dublin Circuit Criminal Court and the High Court - Central Criminal Court
ga: • Tógann oifigí na Cúirte Chuardaí in Átha Cliath an cúram orthú féin chun giúiré a roghnú don Chúirt Choiriúil Chuarda Átha Cliath agus don Ard Chúirt - an Chúirt Choiriúil Lárnach

source: • The Dublin Circuit Court office manages jury selection for certain civil cases in the High Court
ga: • Tógann Oifigí na Cúirte Chuardaí in Átha Cliath cúram orthú féin do roghnú giúiré i gcásanna sibhialta áirithe don Ard Chúirt

source: The Circuit Court office processes family law applications, including
ga: Bíonn oifig na Cúirte Chuarda ag plé le hiarratais dlí i gcúrsaí clainne , mar

source: • The Circuit Court Office deals with criminal cases that are sent forward for trial from the District Court
ga: • Bíonn oifig na Cúirte Chuardaí ag plé le cásanna coiriúla atá seolta ar aghaidh chun trialach chuig an Chúirt Dúiche

source: • The Dublin Circuit Court office handles arraignments, listing, legal aid, probation warrants, fines, bail and sentence reviews for cases in the Dublin Circuit Criminal Court, the High Court - Central Criminal Court and the Special Criminal Court
ga: • Bíonn oifig na Cúirte Chuardaí i mBaile Átha Cliath ag plé le heagraithe, le liostaí, le cuidiú dlí, le barántais phróbhaide, le fíneálacha, le bannaí, le athbhreithniú breithe do chásanna sa Chúirt Choiriúil Chuarda Átha Cliath, san Ard Chúírt - an Chúirt Choiriúil Lárnach agus an Chúirt Choiriúil Speisialta
